resume_scrach.org
#+TITLE: Resume
* 镜像打包工具开发
- 工具主要职责：将开发人员编译得到的二进制根据配置进行加密签名填充后生成最终可以烧写到芯片的镜像
- 使用 =Flask= + =Bootstrap4= 开发
- 提供注册登录功能，登录的用户提供加密密钥的管理
- 使用 =Flask-Migrate= 对表模型构建与迁移
- 使用 =Cryptography= 库完成中间加密任务
- 对接加密中心与签名中心完成加密与签名任务
- 使用 =Flask-File-Upload= 提供文件的上传功能
* 用户画像
- 项目主要职责：通过对工厂员工的产品良率、加班时长、领导评价等多个维度生成用户画像，为人力的晋升以及自我提高提供参考
- 使用 =Kettle= 进行ETL 将数据抽取到数仓
- 使用 =Pandas= 与 =Scikit-learn= 完成标签的生成
- 使用 =Flask= 提供前端调用接口
- 与前端合作，将项目部署到企业微信中，用户可通过企业微信查看自己的画像
* 成品规格书数字化
- 项目主要职责：对历史上所有成品规格书文档（docx 与pdf)解析，将所有成品属性提取入库，提供接口给前端对接，业务人员可方便查询历史成品
- 使用 =Python-docx= 与 =Pdfplumber= 对文档解析
- 使用 =Pandas= 对数据进行清洗
- 使用 =Kettle= 进行ETL 将数据抽取到数仓
- 使用 =Flask= 提供前端调用接口
- 与前端合作，将项目部署到企业微信中，用户可通过企业微信查看自己的画像
* 个人评价
- 主力为 =Python= 语言，对 =Python= 理解较为深刻，知道如何写出 Pythonic 的代码
- 熟悉高级 =Python= 技巧，熟悉 =Python= 标准库
- 对编程非常感兴趣，业余学习 =Go= =Java= 等语言
- 对提升工作效率非常在乎，熟练掌握 =Emacs= 与 =Vim=
